Merge pull request #2 from darth-dodo/feature/m2-product-spec-v2
feat: product spec v2
